Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །གཟུགས་ཀྱི་འགྲིབ་པ་གང་ལགས་པ་དེ་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་ནི་འདི་ལྟར་གཟུགས་མེད་པ་ལ་ཀུན་བརྟགས་པའི་རྣམ་པ་ནི་འགྱུར་བའི་ཕྱིར་འགྲིབ་པ་ཞེས་བྱ་སྟེ་བརྟགས་པའི་གཟུགས་ཀྱི་འགྲིབ་པ་གང་ཡིན་པ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་མ་ཡིན་ནོ།
en: A decrease in form is not form”—“a decrease” is because of a change in the falsely imagined aspect in the form that is a nonexistent thing. That which is “a decrease in” falsely imagined “form is not” the true dharmic nature of “form.” “

source: །དེ་ལྟར་ན་གཟུགས་དང་འགྲིབ་པ་དེ་གཉིས་སུ་མ་མཆིས་ཤིང་གཉིས་སུ་བགྱིར་མ་མཆིས་ཞེས་བྱ་བ་ནི་གཟུགས་དང་འགྲིབ་པ་གཉི་ག་ཡང་བརྟགས་པ་ཡིན་པས་མེད་པའི་ཕྱིར་གཅིག་ཁོ་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, form and a decrease are not two nor are they divided” means because both “form and a decrease” are falsely imagined and nonexistent things they are therefore just one. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་འགྲིབ་པ་ནི་གཅིག་མ་ལགས་མང་པོ་མ་ལགས་ཞེས་བྱ་བ་ནི་འགྲིབ་པ་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར།
en: Lord, it is because a decrease is not one nor is it many.”

source: སྒྱུ་མའི་གཟུགས་བཞིན་དུ་དོན་དམ་པར་གྲངས་ཀྱི་བྱེ་བྲག་མེད་དོ།
en: A decrease does not exist, so, like an illusion of form, ultimately it has no specific particular number.

source: །དེ་བས་ན་བརྟགས་པའི་རང་བཞིན་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་རང་བཞིན་དུ་གཅིག་པ་ཉིད་དོ།
en: Therefore, all falsely imagined things are just one as nonexistent things. “

source: །དེ་ལྟ་བས་ན་གཟུགས་ཀྱི་འགྲིབ་པ་གང་ལགས་པ་དེ་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་འགྲིབ་པ་དེ་ཆོས་ཉིད་ཀྱི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: So, a decrease in form is not form.” This means “a decrease in” falsely imagined “form is not” the intrinsic nature of the true dharmic nature of “form.” “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་ཉིད་ནི་མི་རྟག་པ་སྟེ། དེ་བཞིན་ཉིད་ཀྱི་འགྲིབ་པ་གང་ལགས་པ་དེ་དེ་བཞིན་ཉིད་མ་ལགས་ཞེས་བྱ་བ་འདི་ལ་ཡང་དྲི་མ་དང་བཅས་པ་དང་།
en: Lord, suchness is impermanent, so a decrease in suchness is not suchness.”

source: དྲི་མ་མེད་པའི་བྱེ་བྲག་གིས་སྦྱར་བར་བྱའོ།
en: Here also construe the particular stained and unstained suchness.

source: །འདི་ལྟར་སྔར་དྲི་མ་དང་བཅས་པར་གྱུར་པ་ལས་ཕྱིས་དྲི་མ་མེད་པར་འགྱུར་ཏེ་དེའི་ཕྱིར་མི་རྟག་པའོ།
en: Thus, it is “impermanent” because from the one that was stained before comes about an unstained one later.

source: །དེ་ལྟར་མི་རྟག་པའི་དེ་བཞིན་ཉིད་ལ་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད། ཚོར་བའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པའི་འགྲིབ་པ་དེ་ཡོངས་སུ་གྲུབ་པའི་དེ་བཞིན་ཉིད་མ་ཡིན་ནོ་ཞེས་སྦྱར་བར་བྱའོ།
en: Thus construe it as: the “suchness that is impermanent”—the “decrease” that is “the suchness of form,” “the suchness of feeling,” and so on—“is not” the thoroughly established “suchness.”

source: །གང་ཡང་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་གཟུགས་ཞེས་བགྱི་བ་འདི་ནི་གཉིས་སུ་མ་མཆིས་པའི་གྲངས་སུ་བགྱིས་པའོ་ཞེས་བྱ་བ་ལ་གཉིས་སུ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་དེ་དོན་དམ་པའོ།
en: Where it says, “Lord, anything called form is counted as not two,” “not two” is the true nature of dharmas, the ultimate. “

source: །དོན་དམ་པ་དེའི་གྲངས་སུ་བྱ་བ་ནི་འདི་ལྟ་སྟེ་གཟུགས་དང་ཚོར་བ་ཞེས་བྱ་བ་ལ་སོགས་པ་བྱས་པའོ།
en: Counted” in that ultimate are these, namely, “form,” “feeling,” and so on.

source: །དེས་ཅི་བསྟན་ཞེ་ན་དོན་དམ་པ་གཅིག་ཁོ་ན་སྟེ་གཉིས་སུ་མེད་པ་ལ།
en: What is this teaching?

source: ཆོས་ཉིད་ཀྱི་གཟུགས། ཆོས་ཉིད་ཀྱི་ཚོར་བ། ཆོས་ཉིད་ཀྱི་འདུ་ཤེས། ཆོས་ཉིད་ཀྱི་འདུ་བྱེད། ཆོས་ཉིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ལ་སོགས་པའི་ཚིག་གིས་དོན་དམ་པ་གཅིག་སྟེ་གཉིས་སུ་མེད་པ་ལ་རྣམ་པ་མང་པོར་ཕྱེ་ནས་བསྟན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that even while the ultimate is just one, is “not two,” with the words “form that is the true nature of dharmas, feeling that is the true nature of dharmas, perception that is the true nature of dharmas, volitional factors that are the true nature of dharmas, and consciousness that is the true nature of dharmas” it teaches the one nondual ultimate, having divided it into many aspects.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ་ཞེས་པ་འདི་གང་དང་སྦྱར་ཞེ་ན།
en: With that you should connect “then venerable Śāriputra inquired of venerable Subhūti” as follows.

source: གང་རྣམ་པར་མི་རྟོག་པ་ཡིད་ལ་བྱེད་པའི་འབྲས་བུ་བསྟན་མ་ཐག་པ་ལ་གནས་བརྟན་རབ་འབྱོར་གྱིས་འགྲེས་བཞི་བསྟན་ཏེ། བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་ཆོས་དེ་དག་ལ་འདི་ལྟར་ཉེ་བར་རྟོག་པ་དེའི་ཚེ་གཟུགས་ལ་མི་འཛིན་ཅིང་མི་ལེན་མི་གནས་ཏེ་མངོན་པར་ཞེན་པར་མི་བགྱིད་ཅེས་བྱ་བ་ནི་གཅིག་གོ། །གཟུགས་ཀྱི་མ་སྐྱེས་པ་གང་ལགས་པ་དེ་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གཉིས་པའོ། །གཟུགས་ཀྱི་འགྲིབ་པ་གང་ལགས་པ་དེ་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་ནི་གསུམ་པའོ། །གཟུགས་ཞེས་བགྱི་བ་འདི་ནི་གཉིས་སུ་མ་མཆིས་པའི་གྲངས་སུ་བགྱིས་པ་ལགས་སོ་ཞེས་བྱ་བ་ནི་བཞི་པའོ།
en: In the immediately preceding teaching about the result of the attentions to the nonconceptual, the elder Subhūti gave an explanation in four connected sections: first, “When bodhisattva great beings practicing the perfection of wisdom investigate those dharmas like that they do not then grasp, do not accept, do not base themselves on, and do not settle down on form, and neither do they label anything ‘this is form’ ”; second, “form is not produced, and the nonproduction of form is not form,” and so on; third, “a decrease in form is not form”; and fourth, “anything called form is counted as not two.”

source: །འགྲེས་བཞི་པོ་འདི་དག་ཉེ་བར་བཟུང་ནས་དེ་ལས་རྒྱ་ཆེར་བསྟན་པ་ཉན་འདོད་པའི་ཕྱིར་གནས་བརྟན་ཤཱ་རིའི་བུས་དྲི་བ་དྲིས་སོ་ཞེས་བྱ་བ་དེ་ལྟ་བུར་སྦྱར་རོ། །དེ་ལ་འགྲེས་དང་པོ་ལ།
en: The elder Śāriputra, taking these four connected sections as his point of departure, asks the questions because he wants to hear a more detailed explanation.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་འདི་ལྟར་ཉེ་བར་རྟོག་སྟེ་ཞེས་བྱ་བ་ཚིག་གསུམ་ཉེ་བར་བཟུང་ནས་དྲི་བ་གསུམ་དྲིས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་།
en: Among these, in the first section, taking the three parts of the statement, “bodhisattva great beings practicing the perfection of wisdom investigate those dharmas like that,” as the point of departure, it asks three questions: “What is a bodhisattva?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གང་ཉེ་བར་རྟོག་པ་ནི་གང་ཞེས་བྱ་བའོ།
en: What is the perfection of wisdom? What is it to investigate?”

source: །དེ་དག་{གོ་རིམས་,གོ་རིམ་}བཞིན་དུ་བཤད་པར་བྱ་སྟེ།
en: They will be explained sequentially.

source: བྱང་ཆུབ་ཉིད་སེམས་དཔའ་སྟེ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ་ཞེས་བྱ་བ་ལ་བྱང་ཆུབ་ཅེས་བྱ་བ་ནི་ཆོས་ཀྱི་སྐུ་ལ་བྱའོ།
en: In “they are called bodhisattvas because awakening is itself their state of being,” take “awakening” as the dharma body.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་སྐུའི་བདག་ཉིད་དེ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་ཀྱི་བདག་ཉིད་ཁོ་ནའོ།
en: All “beings” have the dharma body as their nature, therefore bodhisattvas also have just “awakening” as their nature.

source: །དེ་ལྟ་བས་ན་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་ནི་སེམས་དཔའ་ཡིན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: So, it means they are called bodhisattvas because awakening is their nature, and because they are beings.

source: །དེ་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔར་མི་འགྱུར་རམ་ཞེ་ན།
en: In that case, would not all beings then become bodhisattvas?

source: སྤྱིར་གླེང་བ་ལ་ཁྱད་པར་དུ་བརྗོད་པར་འདོད་པས་ཁྱད་པར་དུ་བྱང་ཆུབ་དང་འབྲེལ་བའི་སེམས་དཔའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བས་འདི་ལ་ཉེས་པ་མེད་དོ།
en: There is not this fault here, because in the passage in general it wants to convey a special quality, so it is calling particular beings connected with awakening bodhisattvas.

source: །དེ་ལས་གཞན་པའི་སེམས་ཅན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་ཚོལ་ཞིང་དེའི་དོན་མི་སྒྲུབ་པ་རྣམས་ནི་བྱང་ཆུབ་དང་འབྲེལ་བ་གང་ཡང་མེད་པའི་ཕྱིར་འདི་ནི་ཁྱད་པར་དུ་བྱང་ཆུབ་དང་འབྲེལ་བའི་སེམས་དཔའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། །དེ་བས་ན་འདིའི་སྤྱོད་པ་ཁྱད་པར་ཅན་ཡང་སྟོན་ཏེ།
en: Thus, beings other than them who are not seeking for the knowledge of all aspects and who do not establish that state of being, are not connected in any way with awakening, so it is beings connected with awakening in particular who are being called bodhisattvas.

source: བྱང་ཆུབ་དེས་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཤེས་ཏེ་ཆོས་དེ་དག་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ་ཞེས་བྱ་བ་ནི་ཀུན་རྫོབ་ཀྱི་བདེན་པས་ནི་ཤེས་ཏེ་དོན་དམ་པར་ནི་མངོན་པར་ཞེན་པ་མེད་དོ།
en: Therefore, it also teaches their special practice: “And with that awakening they know the aspects of dharmas but they do not settle down on those dharmas.” They “know” them as conventional truth, but ultimately “do not settle down on” them. “

source: །རྣམ་པ་གང་དག་དང་། རྟགས་གང་དག་དང་། མཚན་མ་གང་དག་གིས་ཞེས་བྱ་བ་ལ་རྣམ་པ་གང་གིས་ཞེས་བྱ་བ་ནི་བསྟན་པའོ།
en: Whatever the attributes, tokens, and signs on account of which”— this teaches the “attributes” through which dharmas are formulated.

source: །རྟགས་དང་མཚན་མ་གཉིས་ནི་དེའི་བཤད་པའོ།
en: The two—“tokens and signs”—are explaining those.

source: །མིང་དང་། བརྡ་དང་བརྟགས་པ་ལ་སོགས་པ་ནི་རྟགས་སོ། །མཚན་ཉིད་དང་། སྤྱོད་པ་ནི་མཚན་མའོ།
en: Names, designations, conventional terms and so on are “tokens”; characteristic marks and behaviors are “signs.” “

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་གང་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་རིང་དུ་སོང་བ་སྟེ་ཞེས་བྱ་བ་ལ།
en: Venerable Śāriputra, that which is called perfection of wisdom has gone far off.”

source: ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་སོང་བའི་ཤེས་རབ་ནི་ཆོས་དེ་དག་ཐམས་ཅད་ལས་རིང་དུ་གྱུར་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Because wisdom that has gone to the other side of all dharmas has gone far off from those dharmas, it “is called wisdom gone to the other side.” “

source: །ཐབས་དང་རིགས་པས་རྟོགས་པ་ནི་ཉེ་བར་རྟོགས་པའོ།
en: To investigate” is realizing through skillful means and reasoning.

source: །དེའི་འོག་ཏུ་འགྲེས་གཉིས་པ་ནི། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་དེ་སྐད་དུ་གཟུགས་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ཞེས་ཟེར་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏོ།
en: After that, the second section is taught by, “Venerable Subhūti, why do you say, ‘…the nonproduction of form is not form…,’ ” and so on. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ཞེས་བྱ་བ་ནི་རྣམ་པར་བརྟགས་པའི་གཟུགས་དེ་གཟུགས་ཀྱི་དངོས་པོར་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Venerable Śāriputra, form is empty of form” means falsely imagined form does not exist as the real basis of form. “

source: །གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ཀྱི་རང་བཞིན་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ཞིང་སྐྱེ་བའི་ངོ་བོ་ཉིད་ཀྱང་མ་ཡིན་ནོ།
en: The emptiness of form is not form, and is not production.” The emptiness of a basic nature that is the true dharmic nature of form is not the intrinsic nature of form, and it is also not the intrinsic nature of production. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན་གཟུགས་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཀུན་བརྟགས་པའི་གཟུགས་ནི་སྐྱེ་བ་མེད་པ་སྟེ་སྐྱེ་བའི་ངོ་བོ་ཉིད་ཀྱང་མ་ཡིན་ནོ། །དེ་བས་ན་མི་སྐྱེ་བ་ནི་གཟུགས་མ་ཡིན་པར་དེ་ལྟར་གྲུབ་པོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Venerable Śāriputra, because of this one of many explanations, the nonproduction of form is not form” means because falsely imagined form does not arise and does not have arising as its intrinsic nature, therefore nonproduction is thus established as not form.

source: །དེའི་འོག་ཏུ་འགྲེས་གསུམ་པའི་སྐབས་ནི་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་དེ་སྐད་དུ་གཟུགས་ཀྱི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ཞེས་ཟེར་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏོ།
en: After that, with “Venerable Subhūti, why do you say, ‘It is because a decrease in form is not form,’ ” and so on, it teaches the third section.

source: །གཟུགས་གང་ཡིན་པ་དང་འགྲིབ་པ་གང་ཡིན་པ་དེ་གཉི་ག་ཡང་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ནི་སྔར་བཤད་པའི་ཚུལ་གྱིས་གཟུགས་ཀྱང་བརྟགས་པ། འགྲིབ་པ་ཡང་བརྟགས་པ་སྟེ། དེ་བས་ན་གཉི་ག་ཡང་མཚན་ཉིད་མེད་པའོ།
en: Form and decrease are both “not conjoined and not disjoined”— in the way explained before, form is a construct, and decrease is also a construct, so both “have no mark.”

source: །འགྲེས་བཞི་པ་ལ། མ་སྐྱེས་པ་ཡང་གཞན་མ་ཡིན་གཟུགས་ཀྱང་གཞན་མ་ཡིན་ཏེ། མ་སྐྱེས་པ་ཉིད་ཀྱང་གཟུགས་སོ།
en: In the fourth connected section, “nonproduction is not one thing and form another; nonproduction itself is form, and form itself is nonproduction.”

source: །གཟུགས་ཉིད་ཀྱང་མ་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་སྔར་བཤད་པའི་ཚུལ་གྱིས་གཟུགས་ཞེས་བྱ་བ་དང་མ་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ལ་བྱ་སྟེ།
en: In the way explained before, take “form” and “nonproduction” as the true nature of dharmas.

source: དེའི་ཕྱིར་གཉིས་སུ་མེད་དོ།
en: Hence, they are “not two.”

source: །གཟུགས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་མངོན་སུམ་དུ་བྱེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: As for “they then view the nonproduction of form,” this means they directly realize suchness.

source: །གཟུགས་མ་སྐྱེས་པ་ཞེས་བྱ་བ་ནི། སྔ་མ་བཞིན་དུ་ཆོས་ཉིད་ཀྱི་གཟུགས་དང་དེ་བཞིན་ཉིད་གཅིག་པའི་ཕྱིར་དེ་སྐད་བསྟན་ཏོ།
en: As before, it says “the nonproduction of form” because the true dharmic nature of form and suchness are the same.

source: །འདི་མན་ཆད་ནི་གནས་བརྟན་གཉིས་ཀྱིས་དྲིས་པ་དང་ལན་འདེབས་པ་ཞིབ་མོར་འབྱུང་སྟེ།
en: The questions and responses of the two elders From here on there are the probing questions and responses of the two elders.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གལ་ཏེ་གཟུགས་ཀྱང་སྐྱེ་བ་མེད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ཡང་སྐྱེ་བ་མེད་པ་ཡིན་ན་ནི་ཉན་ཐོས་ཀྱིས་ཀྱང་ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་ཐོབ་ཟིན་པར་མི་འགྱུར་རམ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཅི་བསྟན་ཞེ་ན།
en: What does “Venerable Subhūti, if form is a nonproduction, up to the buddhadharmas are a nonproduction, then, Venerable Subhūti, will śrāvakas not have already gained śrāvaka awakening,” and so on, teach?

source: གལ་ཏེ་གཟུགས་ལ་སོགས་པ་དང་། དེ་བཞིན་ཉིད་གཅིག་པ་ཡིན་ན། དེ་ལྟ་ན་གཟུགས་ལ་སོགས་པ་རྟོགས་པས་དེ་བཞིན་ཉིད་རྟོགས་པར་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་དོན་དམ་པ་མཐོང་བར་འགྱུར་རོ།
en: If “form,” and so on, and suchness were the same, in that case the understanding of form would be the understanding of suchness, and all beings would see the ultimate as well.

source: །དེ་ལྟར་གྱུར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསྒྲིམ་མི་དགོས་པ་ཉིད་དུ་སོ་སོའི་བྱང་ཆུབ་ཇི་ལྟ་བ་བཞིན་དུ་ཐོབ་པར་འགྱུར་རོ།
en: Were they to do so, all beings would each properly reach their own respective awakening without having to concentrate on it.

source: །འོ་ན་ནི་བྱང་ཆུབ་རྣམ་པ་ལྔ་པོ་དག་ཀྱང་ཐ་དད་པ་མེད་པར་འགྱུར་རོ། །རྒྱུན་དུ་ཞུགས་པ་དང་།
en: And then “the five awakenings” would not be differentiable.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་བྱང་ཆུབ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམས་ཀྱང་འདྲེས་པར་འགྱུར་རོ།
en: stream enterer, once-returner, non-returner, worthy one, a pratyekabuddha’s awakening, and the knowledge of all aspects would be mixed up.

source: །དེ་ལྟར་གྱུར་ན་རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་ཡང་སངས་རྒྱས་ཡིན་པར་འགྱུར་ཏེ།
en: Were that to be the case, stream enterers and so on would also be buddhas.

source: ཉོན་མོངས་པ་ལྷག་མ་སྤོང་བར་འབད་པ་དོན་མེད་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བྱང་ཆུབ་ཐོབ་ཟིན་པས་དཀའ་བ་སྤྱད་པ་ལ་སོགས་པ་དོན་མེད་པར་འགྱུར་རོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཡང་དོན་མེད་པ་ཉིད་དུ་འགྱུར་རོ།
en: Bodhisattvas would have already gained their awakening, so to “undertake the difficult practices” and so on would be meaningless, and the knowledge of all aspects, complete awakening, and “turning the wheel of the Dharma” would be meaningless as well. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་ཆོས་མ་སྐྱེས་པ་ལ་འཐོབ་པ་དང་། མངོན་པར་རྫོགས་པ་ཡོད་པར་མི་འདོད་དོ།
en: Venerable Śāriputra, I do not accept that an unproduced dharma has an attainment, or a clear realization.

source: །བདག་ནི་མ་སྐྱེས་པ་ལ་རྒྱུན་དུ་ཞུགས་པ་ཡོད་པར་མི་འདོད།
en: I do not accept that which is unproduced becomes a stream enterer.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཡོད་པར་མི་འདོད་དོ་ཞེས་བྱ་བས་ཅི་བསྟན་ཞེ་ན།
en: I do not accept that which is unproduced has the result of stream enterer.” What does this teach?

source: ཆོས་མ་སྐྱེས་པ་ནི་སུས་ཀྱང་ཐོབ་པའམ། མངོན་པར་རྟོགས་པར་མི་ནུས།
en: Nobody can attain or have a clear realization of an unproduced dharma.

source: མ་སྐྱེས་པ་ལ་གང་ཡང་རྒྱུན་དུ་ཞུགས་པར་མི་འགྱུར་གྱི།
en: Given that it is unproduced, no one at all becomes a stream enterer.

source: ཀུན་བརྟགས་པའི་སྒྲིབ་པ་ཙམ་བསྩལ་བ་ནི་གཟུང་བ་དང་འཛིན་པའི་རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པར་འདོད་དོ།
en: The elimination of mere falsely imagined obscurations, because the conceptualization of a grasper and grasped does not exist, are accepted to be the attainment and clear realization.

source: །དེ་བས་ན་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་ཉིད་རྟོགས་པ་མ་ཡིན་ནོ་ཞེས་བསྟན་པ་ཡིན་ཏེ། དེ་བས་ན་གཟུགས་ལ་སོགས་པ་རྟོགས་པས་དེ་བཞིན་ཉིད་རྟོགས་པར་འགྱུར་རོ་ཞེས་བྱ་བ་སྔར་སྨྲས་པའི་སྐྱོན་དེ་སྐྱོན་དུ་མི་འགྱུར་ཏེ་ཉོན་མོངས་པ་དང་། ཤེས་བྱའི་སྒྲིབ་པ་རྣམས་ཡོད་པའི་ཕྱིར་རོ།
en: So, it is teaching that “suchness does not realize suchness,” and hence the aforementioned fault that “the understanding of form and so on will be the understanding of suchness” is not a fault, because there are afflictive obscurations and obscurations to knowledge. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་བྱང་ཆུབ་སེམས་དཔའ་དཀའ་བ་སྤྱད་པ་སྤྱོད་པར་མི་འདོད་ཅེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་དོན་དམ་པར་དེ་ལྟ་བུའི་རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར་དེ་སྐད་བསྟན་ཏོ།
en: Venerable Śāriputra, I do not accept that bodhisattvas are undertaking difficult practices.” It explains this because ultimately bodhisattvas do not have such conceptualizations.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་ས་བརྒྱད་པ་ལ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པས་གང་གི་ཚེ་ཆོས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་དམིགས་པ་དེའི་ཚེ་སྐྱེ་བ་ལ་སོགས་པ་དང་བྲལ་བར་དཀའ་བ་སྤྱད་པ་རྩོམ་སྟེ།
en: At the eighth level when bodhisattvas gain forbearance for dharmas that are not produced and do not apprehend any dharma at all, they undertake difficult practices free from production and so on.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་ལ་མགོ་བཅད་པ་ལ་སོགས་པ་ལ་དཀའ་བའི་འདུ་ཤེས་སམ། སྡུག་བསྔལ་གྱི་འདུ་ཤེས་གང་ཡང་མི་འབྱུང་ངོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཆོས་གང་ཡང་མི་ལེན་མི་དམིགས་སོ་ཞེས་བྱ་བ་མཇུག་གི་ཚིག་གིས་བསྟན་ཏོ།
en: At that time bodhisattvas have a nonapprehending attention and do not have “the idea of difficulty” when it comes to cutting off their heads and so on, or “any idea of suffering at all.” The concluding passage, “bodhisattva great beings do not appropriate and do not apprehend any dharma as anything in any way at all,” teaches that. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་མ་སྐྱེས་པ་ལ་དེ་བཞིན་གཤེགས་པ་ཡོད་པར་མི་འདོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་མ་སྐྱེས་པ་ཆོས་ཀྱི་སྐུ་ལ་དེ་བཞིན་གཤེགས་པ་གང་གིས་མ་སྐྱེས་པ་རྟོགས་པར་འགྱུར་བའི་དེ་བཞིན་གཤེགས་པ་གཉིས་པ་ཡོད་པར་མི་འདོད་པའོ།
en: Venerable Śāriputra, in the absence of production I do not accept that there is the state of a tathāgata,” and so on—“in the absence of production” in the dharma body “I do not accept that there is” any tathāgata that is a second tathāgata realizing the absence of production.

source: །དེ་བས་ན་མ་སྐྱེས་པ་ཉིད་དེ་བཞིན་གཤེགས་པ་མ་སྐྱེས་པ་ཉིད་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: Hence this is teaching the unproduced state, that “a tathāgata” is the unproduced state, perfect complete awakening. “

source: །མ་སྐྱེས་པའི་ཆོས་ཀྱིས་ཀྱང་མ་སྐྱེས་པ་ཐོབ་པར་མི་འདོད་དོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་ཉིད་ལ་རབ་ཏུ་རྟོགས་པར་བྱེད་པར་མི་འདོད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: I do not accept that an unproduced dharma attains an unproduced attainment.” “I do not accept” that suchness realizes suchness is the meaning.

source: །དེ་སྐད་སྨྲས་པ་དང་གནས་བརྟན་ཤཱ་རིའི་བུས། གལ་ཏེ་མ་སྐྱེས་པས་མ་སྐྱེས་པའི་ཐོབ་པ་མི་ཐོབ་ན་ཅི་མ་སྐྱེས་པས་སྐྱེས་པའི་ཐོབ་པ་འཐོབ་བམ། འོན་ཏེ་སྐྱེས་པས་མ་སྐྱེས་པའི་ཐོབ་པ་འཐོབ་ཅེས་རྣམ་པར་རྟོག་པ་གཉིས་དྲིས་ཏེ།
en: He says that, and then the elder Śāriputra asks about two alternatives: Given that something unproduced does not attain an unproduced attainment, does something unproduced attain a produced attainment, or does something produced attain an unproduced attainment? “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅི་ཆོས་མ་སྐྱེས་པས་སྐྱེས་པའི་ཐོབ་པ་འཐོབ་བམ་འོན་ཏེ་ཆོས་སྐྱེས་པས་མ་སྐྱེས་པའི་ཐོབ་པ་འཐོབ་ཅེས་བྱ་བ་ནི་གལ་ཏེ་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་འགའ་ཞིག་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་ཀུན་བརྟགས་པ་རྣམས་ཐོབ་པར་འགྱུར་ན།
en: Well then, Venerable Subhūti, does an unproduced dharma attain a produced attainment, or does a produced dharma attain an unproduced attainment?” If something in the nature of suchness were to attain the falsely imagined results of stream enterer and so on, then “an unproduced dharma would attain a produced attainment.”

source: དེ་ལྟ་ན་ནི་མ་སྐྱེས་པའི་ཆོས་ཀྱིས། སྐྱེས་པའི་ཐོབ་པ་ཐོབ་པར་འགྱུར་རོ། །གལ་ཏེ་ཀུན་བརྟགས་པའི་གང་ཟག་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་ཅན་རྣམས་ཐོབ་པར་འགྱུར་ན་དེ་ལྟར་གྱུར་ན་ནི་སྐྱེས་པའི་ཆོས་ཀྱིས་མ་སྐྱེས་པའི་ཐོབ་པ་ཐོབ་པར་འགྱུར་ཏེ།
en: Were falsely imagined persons to attain the results of stream enterer and so on that are in the nature of suchness, then “a produced dharma would attain an unproduced attainment.”

source: དེ་གཉི་ག་ཡང་མ་བཟོད་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་མ་སྐྱེས་པའི་ཆོས་ཀྱིས་སྐྱེས་པ་ཐོབ་པར་མི་འདོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Since he is unable to accept either of them he says, “Venerable Śāriputra, I do not accept that a produced dharma attains an unproduced attainment,” and so on. “

source: །ཐོབ་པ་ཡང་ཡོད་མངོན་པར་རྟོགས་པ་ཡང་ཡོད་དེ་གཉིས་ཀྱི་ཚུལ་གྱིས་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་མ་སྐྱེས་པས་སྐྱེས་པ་འཐོབ་པ་དང་།
en: There is an attainment and there is a clear realization, but not in a dual way.”

source: སྐྱེས་པས་མ་སྐྱེས་པ་འཐོབ་པ་འདི་གཉིས་ནི་མེད་ཀྱི། འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ནི་ཉོན་མོངས་པ་དང་། ཤེས་བྱའི་སྒྲིབ་པ་སྤོང་བ་ཙམ་ལ་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པ་གདགས་པ་དང་། རྒྱུན་དུ་ཞུགས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་སོགས་པ་གང་ཟག་ཏུ་གདགས་པར་བསྟན་ཏོ།
en: This is teaching that even though both an attainment of the unproduced by the produced, and an attainment of the produced by the unproduced, do not exist, still, on the mere abandonment of afflictive obscurations and obscurations to knowledge, “attainment and clear realization are labeled by ordinary convention,” and the person is labeled “stream enterer, tathāgata,” and so on. “

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པ་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་དེ་བཞིན་དུ་མ་སྐྱེས་པ་ཡང་དེ་ལྟ་ཡིན་ནམ་ཞེས་བྱ་བ་ནི།
en: Venerable Subhūti, is the unproduced similar to the attainment and clear realization that, as ordinary convention, is formless, cannot be pointed out, does not block, and has only one mark—that is, no mark?”

source: ཅི་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པ་བཞིན་དུ་མ་སྐྱེས་པ་ཡང་དོན་དམ་པར་ཡང་མེད་པ་ཡིན་ནམ་ཞེས་འདྲིའོ།
en: Śāriputra is asking if the unproduced is, like attainment and clear realization, also ultimately nonexistent. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་ནི་དོན་དམ་པ་ནི་གཟུང་དུ་མེད་ཅིང་བརྗོད་དུ་མེད་པའི་ཕྱིར་མ་སྐྱེས་པ་ཡང་མ་སྐྱེས་པའི་རྣམ་པ་མེད་དོ་ཞེས་བསྟན་པའོ།
en: Exactly so, Venerable Śāriputra” teaches that because, ultimately, an unproduced cannot be grasped and cannot be expressed, it does not exist in an unproduced form.

source: །ད་ནི་སྐྱེ་བ་ཡང་བསྩལ་བའི་ཕྱིར། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན་སྐྱེ་བ་ཡང་མི་སྐྱེ་མི་སྐྱེ་བ་ཡང་མི་སྐྱེའོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Now, because even production is eliminated, it says, “Venerable Śāriputra, because of this one of many explanations neither is production produced nor is nonproduction produced.”

source: མ་སྐྱེས་པ་ནི་ཡོངས་སུ་གྲུབ་པ་ཡིན་པས་མི་སྐྱེའོ། །སྐྱེས་པ་ནི་ཀུན་བརྟགས་པ་ཡིན་ཏེ་མེད་པའི་ཕྱིར་མི་སྐྱེའོ། །དེ་བས་ན་རྣམ་གྲངས་འདི་ལ་སྐྱེ་བ་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means the “unproduced” is the thoroughly established so it is not produced; the “produced” is the falsely imagined so it is nonexistent and therefore not produced, so in “this one of many explanations… production” also does not exist. “

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་མ་སྐྱེས་པའི་ཆོས་མ་སྐྱེས་པའི་ཆོས་ཞེས་བྱ་བར་བརྗོད་པར་སྤོབས་སམ།
en: Venerable Subhūti, you are confident in your readiness to say again and again that ‘dharmas are unproduced’?
